app/controllers/signed_in/tasks_controller.rb

  def index
    @task_filter = if params.has_key? :task_filter
                     TaskFilter.new(params[:task_filter])
                   else
                     TaskFilter.new
                   end

    @task_deletion = TaskDeletion.new

    @tasks = current_user.tasks
                 .includes(:category)
                 .includes(:tags)
                 .apply_filter(@task_filter)
                 .order(category_id: :desc)
                 .all

    @categories = current_user.categories.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 1)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND (is_done = 't') AND "tasks"."category_id" = 0 AND (tags.id IN 0,2) ORDER BY "tasks"."category_id" DESC  [["user_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ?  [["user_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "color", "deadline_at", "note", "is_done", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "deadline_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["deadline_at", "2019-12-23 00:00:00"], ["updated_at", "2019-12-04 07:44:07.439237"], ["id", 1]]

  def set_user_categories
    @user_categories = current_user.categories.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 4]]

  def set_user_tags
    @user_tags = current_user.tags.all
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_associations" ON "tags"."id" = "tag_associations"."tag_id" WHERE "tag_associations"."task_id" = ?  [["task_id", 4]]