app/controllers/signed_in/tasks_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @task_filter = if params.has_key? :task_filter
                     TaskFilter.new(params[:task_filter])
                   else
                     TaskFilter.new
                   end

    @tasks = Task
                 .includes(:category)
                 .includes(:tags)
                 .for_user_id(current_user.id)
                 .apply_filter(@task_filter)
                 .order(category_id: :desc)
                 .all

    @categories = Category.for_user_id(current_user.id).all