app/controllers/settings/categories_controller.rb

INSERT INTO "categories" ("title", "color", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["color", "#ea0000"], ["user_id", 1], ["created_at", "2019-11-26 12:35:48.302473"], ["updated_at", "2019-11-26 12:35:48.302473"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save