app/controllers/settings/tags_controller.rb

INSERT INTO "tags" ("title", "color", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Nový tag"], ["color", "#000000"], ["user_id", 1], ["created_at", "2019-11-26 12:57:17.408002"], ["updated_at", "2019-11-26 12:57:17.408002"]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

UPDATE "tags" SET "title" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["title", "Nový tagasdfasf"], ["updated_at", "2019-11-26 13:01:30.468317"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tag.update(tag_params)