app/views/signed_in/settings/tags/show.html.erb

SELECT "tasks".* FROM "tasks" INNER JOIN "tag_associations" ON "tasks"."id" = "tag_associations"."task_id" WHERE "tag_associations"."tag_id" = ?  [["tag_id", 2]]
---
    <ul>
      <% @tag.tasks.each do |task| %>