app/controllers/signed_in/settings/categories_controller.rb

  def index
    @categories = Category.for_user_id(current_user.id).all
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]