app/controllers/signed_in/settings/tags_controller.rb

  def index
    @tags = current_user.tags.all
---
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = ?  [["user_id", 1]]

  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("title", "color", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New tag"], ["color", "#000000"], ["user_id", 1], ["created_at", "2019-12-04 07:28:21.482717"], ["updated_at", "2019-12-04 07:28:21.482717"]]

  def update
    respond_to do |format|
      if @tag.update(tag_params)
---
UPDATE "tags" SET "title" = ?, "color" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["title", "Důležité"], ["color", "#ff0000"], ["updated_at", "2019-12-08 08:13:01.963124"], ["id", 2]]