app/views/signed_in/settings/categories/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = ?  [["category_id", 1]]
---
    <ul>
      <% @category.tasks.each do |task| %>