app/views/signed_in/tasks/show.html.erb

    <ul>
      <% @task.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_associations" ON "tags"."id" = "tag_associations"."tag_id" WHERE "tag_associations"."task_id" = ?  [["task_id", 4]]